Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/introduction_to_the_irish_system/political_system.html.txt.tmx
Source language: en
Languages: ga

source: Political system at national level
ga: An córas polaitiúil ag leibhéal náisiúnta

source: • The Oireachtas (the Irish Parliament)
ga: • An tOireachtas (Parlaimint na hÉireann)

source: The Constitution is the fundamental legal document that sets down how Ireland should be governed
ga: Is Bunreacht na hÉireann í an cháipéis bunata dlí í a dhéanann cur síos ar an mbealach inar cheart Éire a rialú

source: It establishes the Head of State, branches of government, the courts and it also sets out how those institutions should be run
ga: Cuireann an Bunreacht brainsí an rialtais ar bun, cuireann sé na cúirteanna ar bun, agus leagann sé síos an bealach inar ceart iad a eagrú

source: The Constitution has another important function; it describes the fundamental rights that every Irish citizen is entitled to
ga: Tá feidhm thábhachtach eile ag an mBunreacht; déanann sé cur síos ar na bunchearta atá ag gach saoránach Éireannach

source: The Oireachtas (the Irish Parliament)
ga: An tOireachtas (Parlaimint na hÉireann)

source: The Dáil and Seanad (Senate) are collectively known as the Houses of the Oireachtas
ga: Tithe an Oireachtais a thugtar ar an Dáil agus ar an Seanad le chéile

source: The Government is chosen by and is collectively responsible to the Dáil
ga: Déanann an Dáil an Rialtas a roghnú agus tá sé freagrach don Dáil

source: There must be a minimum of 7 and a maximum of 15 Ministers
ga: Ní mór ar a laghad 7 Aire agus ar a mhéid 15 a bheith ann

source: The Taoiseach, the Tanaiste and the Minister for Finance must be members of the Dáil
ga: Ní mór don Taoiseach, don Tánaiste agus don Aire Airgeadais a bheith ina dTeachtaí Dála

source: It is possible to have 2 Ministers who are members of the Senate but this rarely happens
ga: Is féidir 2 bhall den Seanad a roghnú ina nAirí ach ní tharlaíonn seo ach go fíor annamh

source: The Government's main functions are to propose legislation, manage the public finances and administer the government departments
ga: Tá sé mar phríomhfheidhmeanna ag an Rialtas reachtaíocht a mholadh, an ciste poiblí a riaradh agus na ranna rialtais a riaradh

source: The Government is responsible to the Dáil
ga: Tá an Rialtas freagrach don Dáil

source: It is not responsible to the Senate
ga: Níl sé freagrach don Seanad

source: However, Ministers have a right to attend the Senate and it is normal practice for the relevant Minister or Minister of State to be present when the House is dealing with their areas of responsibility
ga: Ach, tá sé de cheart ag Airí freastal ar an Seanad agus go hiondúil bíonn an tAire nó an tAire Stáit chuí i láthair sa Seanad nuair atá plé dhá dhéanamh ann ar cheisteanna a bhaineann lena c(h)uid cúraimí féin

source: Much of the work of the Dáil and Senate is now done in Committees
ga: Is tré choistí a dhéantar cuid mhór den obair sa Dáil agus sa Seanad anois

source: Each House may form Committees for particular purposes
ga: Is féidir leis an dá theach coistí a bhunú ar mhaithe le ceisteanna ar leith a phlé

source: Select Committees have the power to take oral and written evidence and seek documents
ga: Tá sé de chumhacht ag Coistí Roghnaithe fianaise béil agus scríofa a thógáil agus cáipéisí a éileamh

source: Joint Committees are Select Committees of each House sitting and voting together
ga: Comhchoistí iad Roghchoistí ón dá theach a shuíonn agus a chaitheann vótaí le chéile

source: Special Committees do not have the same powers as Select Committees
ga: Níl na cumhachtaí céanna ag Coistí Speisialta agus atá ag Roghchoistí

source: In general, Committees deal with Estimates of Expenditure, Committee Stages of Bills relevant to their terms of reference and related reports
ga: Go ginearálta bíonn Coistí ag plé le Meastacháin Chaiteachais, Céim Choiste na mBillí a bhaineann lena dtéarmaí tagartha agus tuairiscí a bhaineann leo sin

source: It is common for Committees to invite voluntary and community organisations and/ or experts to make submissions to them on various issues and it is also common for such organisations to ask to make a submission
ga: Go minic tugann Coistí cuireadh d'eagraíochtaí deonacha agus eagraíochtaí pobail agus/nó saineolaithe aighneachtaí a chur ós a gcomhair ar cheisteanna éagsúla agus go minic déanann na heagraíochtaí sin iarratas na haighneachtaí seo a chur faoi bhráid na gCoistí

source: Controlling the public finances
ga: Smacht a choinneáil ar an gciste poiblí

source: Each year, the Government prepares the Estimates of the Receipts and Expenditure of the State
ga: Gach bliain déanann an Rialtas meastacháin ar Ioncam agus Caiteachas an Stáit

source: This is an outline of the costs of running each Department and Office of State
ga: Costais mheasta reatha atá anseo a bhaineann le gach Roinn agus Oifig Stáit

source: The Estimates are published before the annual Budget
ga: Déantar na meastacháin a fhoilsiú roimh an gCáinaisnéis bhliantúil

source: The Dáil and the relevant Committees debate the Estimates in detail
ga: Déanann an Dáil agus na Coistí cuí na Meastacháin a phlé go mion

source: The Estimates are passed by the Dáil and are given statutory effect by the Appropriation Act
ga: Glacann an Dáil leis na Meastacháin agus tugann an tAcht Leithreasaithe stádas reachtúil dóibh

source: The Budget is given immediate legal effect by financial resolutions of the Dáil on the evening of the Budget speech
ga: Tagann an Cháinaisnéis ina dlí láthaireach tríd na rúin airgeadais a ritheann an Dáil ar an trathnóna a dhéantar óráid na Cáinaisnéise

source: The Finance Act must be passed within 4 months of the Budget
ga: Ní mór an tAcht Airgeadais a rith taobh istigh de 4 mhí ón gCáinaisnéis

source: At present, budgeting is on an annual basis
ga: Faoi láthair, déantar cáinaisnéis ar bhonn bliantúil

source: Proposals for multi-annual budgets are being considered
ga: Tá scrúdú dhá dhéanamh faoi láthair ar mholtaí le cáinaisnéis a dhéanamh ar feadh tréimhsí níos faide blianta

source: You can view the full text of Ireland's Budget here
ga: Léigh téacs iomlán an Bhuiséid anseo

source: The Comptroller and Auditor General is appointed under the Constitution to control on behalf of the State all disbursements and to audit all accounts of moneys administered by or under the authority of the Oireachtas
ga: Ceaptar an tArd-Reachtaire Cuntas agus Ciste faoin mBunreacht le ceannasaíocht a ghlacadh thar cheann an Stáit ar chaiteachas uilig agus iniúchadh a dhéanamh ar gach chuntas airgid atá dhá riaradh ag nó faoi údarás an Oireachtais

source: The Comptroller's functions are set out in legislation
ga: Tá na dualgais atá ar an Ard-Reachtaire Cuntas agus Ciste leagtha síos i reachtaíocht

source: It is almost always the Government of the day that propose new laws
ga: Is é an Rialtas go hiondúil a mholann dlíthe nua

source: A Minister presents a Bill to the Dáil or Seanad for discussion and decision
ga: Cuireann Aire Bille ós comhair na Dála nó an tSeanaid le plé agus cinneadh a dhéanamh air

source: A Bill is proposed legislation - after it is passed and signed by the President, it is called an Act
ga: Bille a thugtar ar reachtaíocht mholta - nuair atá glactha leis agus é sínithe ag an Uachtarán tugtar Acht air

source: Occasionally, a TD or Senator presents what is called a Private Member's Bill
ga: Anois is arís cuireann TD nó Seanadóir Bille Teachta Príobháidigh ós comhair an Tí

source: It is very rare for such a Bill to get beyond the first stage - the reasons for this are political rather than legal
ga: Ní minic go n-éiríonn le Bille mar seo dul níos faide ná an chéad chéim – ar chúinsí polaitiúla seachas dleathúla

source: However, some important legislation in recent years has resulted from Private Members' Bills - notably The Judicial Separation and Family Law Reform Act 1989
ga: Ach, le cúpla bliain anuas tháinig reachtaíocht tábhachtach i bhfeidhm de bharr Bille Teachta Príobháidigh - An tAcht um Scaradh Dleathúil agus Leasú Dlí Teaghlaigh 1989 mar shampla cáiliúil

source: The procedure is the same whether the Bill is proposed by the Government or by a Member
ga: Tá an modh oibre chéanna i bhfeidhm is cuma an moladh ón Rialtas nó ó Theachta eile atá i gceist

source: Usually, a Bill is presented by a Minister to the Dáil
ga: Go hiondúil déanann Aire Bille a chur ós comhair na Dála

source: Occasionally the process is started in the Seanad but any Bills dealing with taxation or related matters must start in the Dáil
ga: Anois agus arís tosaíonn an próiséas sa Seanad ach aon bhillí a bhaineann le cáin nó ceisteanna den tsórt sin ní mór tús a chur leo sa Dáil

source: Each Bill has to go through a number of stages or readings
ga: Ní mór chuile Bhille a chur tríd céimeanna nó léamha faoi leith

source: It can be defeated at any of these stages and, if this happens in the Dáil, the process ends there
ga: Is féidir leis titim ag aon cheann de na céimeanna sin, má tharlaíonn sin sa Dáil, tagann deireadh leis an bpróiséas ansin

source: The Seanad can only obstruct a Bill
ga: Ní féidir leis an Seanad ach bacanna a chur ós comhair Bille

source: In practice, Government Bills are not often defeated
ga: Go ginearálta, ní minic go dteipeann ar Bhillí Rialtais

source: You can view all Irish legislation 1922 to date here
ga: Tá téacs í uile reachtaíochta Éireannach ó 1922 ar fáil ar líne

source: The first stage or reading just involves presenting the title of the Bill to the Dáil (or Seanad). In effect, that just allows the Bill to be printed
ga: An chéad chéim nó léamh níl i gceist ach teideal an bhille a chur ós comhair na Dála (nó ós comhair an tSeanaid)

source: The Bill is then circulated to all TDs (or Senators) and there is a second reading
ga: Níl ansin ach deis a thabhairt an Bille a chur i gcló

source: At this second stage the Minister who is presenting the Bill explains what it is all about
ga: Cuirtear an Bille ansin ar fáil do na Teachtaí Dála ar fad (nó Seanadóirí) agus bíonn an dara léamh ann

source: The next stage is called the Committee stage
ga: Céim an Choiste an chéad chéim eile

source: The Bill is analysed in detail at this stage and amendments may be put down either by the Government or the Opposition
ga: Déantar mionscrúdú ar an mBille ag an bpointe seo agus is féidir leis an Rialtas nó leis an bhFreasúra leasuithe a mholadh

source: The fourth stage - sometimes called the report stage - involves an overall discussion and again, amendments may be put down and voted upon
ga: An cheathrú chéim - tugtar an chéim tuairisce go minic ar seo - plé ginearálta a bhíonn ann agus arís is féidir leasuithe a mholadh agus vóta a chaitheamh orthu

source: The next stage involves sending the Bill to the other House (the Seanad usually) where a similar procedure is followed
ga: Ansin sa chéad chéim eile seoltar an Bille chuig an Teach eile (an Seanad go hiondúil) áit ina bhfuil próiseas simplí le comhlíonadh

source: The Seanad cannot amend or defeat a money Bill
ga: Níl sé de chumhacht ag an Seanad Bille a bhaineann le hairgead a leasú nó a chaitheamh amach

source: It can amend and delay other Bills
ga: Is féidir leis leasú a dhéanamh nó moill a chur ar Bhillí eile

source: When the Bill is passed by both the Dáil and Seanad it is sent to the President for signature
ga: Nuair atá Bille glactha ag an Dáil agus ag an Seanad cuirtear chuig an Uachtarán é le síniú

source: The Bill is now an Act
ga: Acht a thugtar ansin ar an mBille

source: It may become law immediately after the President signs or there may be a clause or clauses in it which specify when it will come into effect
ga: Tagann sé i bhfeidhm díreach tar éis don Uachtarán síniú a chur leis ach amháin sa chás go bhfuil clásál nó clásáil faoi leith luaite ann a dheireann cén uair a thiocfaidh sé i bhfeidhm

source: Subordinate legislation is a lesser form of legislation than Acts
ga: Reachtaíocht i bhfoirm níos lú ná Acht í foreachtaíocht

source: The most common is a Statutory Instrument (SI)
ga: Ionstraim Reachtúil a thugtar ar an bhforeachtaíocht is coitianta

source: There must be specific power laid down in an Act in order to allow a Statutory Instrument to be effective
ga: Ní mór go mbeadh cumhacht faoi leith leagtha síos in Acht le go mbeadh feidhm ag Ionstraim Reachtúil

source: Usually an Act authorises a Minister to make Regulations dealing with details
ga: Go hiondúil tugann Acht údarás d'Aire Rialacha a bhaineann le sonraí a dhéanamh

source: The Act itself sets out the general law
ga: Bíonn an dlí ginearálta leagtha síos san Acht féin

source: The Statutory Instrument cannot deviate in any way from what is laid down in the Act - if they do, they are what is called ultra vires
ga: Ní féidir leis an Ionstraim Reachtúil ar aon bhealach imeacht ón rud atá leagtha síos san Acht - má dhéantar sin tugtar ultra vires air

source: That means "beyond the powers" - that is, the Minister does not have the power to do what he is purporting to do
ga: Ciallaíonn sin taobh amuigh den chumhacht - i.e. níl sé de chumhacht ag an Aire an rud a bhí i gceist aige/aici a dhéanamh

source: Statutory Instruments do not usually have to be passed by the Oireachtas
ga: Ní gá go hiondúil don Oireachtas Ionstraimí Reachtúla a cheadú

source: Apart from Ministers, certain other bodies, mainly regulatory bodies, have the power to make subordinate legislation, for example, the Commission for Telecommunications Regulation (ComReg) and the Incorporated Law Society
ga: Taobh amuigh de na hAirí, is féidir le húdaráis eile faoi leith, go mór mór údaráis rialaithe, foreachtaíocht a dhéanamh, mar shampla an Stiúrthóir Rialacha Teileachumarsáide agus an Cumann Dlí Corpraithe

source: Under the Constitution, Departments of State are administered by members of the Government (Ministers) and the Minister is in charge of the Department
ga: Faoin mBunreacht, bíonn na Ranna Stáit dhá riaradh ag baill an Rialtais (Airí) agus tá an tAire i gceannas na Roinne

source: This means that final responsibility rests with the Minister but many of the functions of the Department and responsibility for various actions are assigned to civil servants
ga: Tá an tAire mar sin freagrach as an Roinn ach bíonn go leor dualgais agus feidhmeanna sa Roinn fágtha faoi chúram na státseirbhíseach

source: Green Papers, White Papers and discussion documents
ga: Páipéir Uainí, Páipéir Bhána agus cáipéisí le plé

source: A Green Paper is a discussion document, usually written by civil servants, in which an issue is outlined, various options are suggested and the advantages and disadvantages of those options may be set out
ga: Cáipéis le plé atá i bpáipéar uaine, scríofa go hiondúiíl ag státseirbhísigh, ina dhéantar cur síos ar cheist, roghanna éagsúla a mholadh agus na buntáistí agus na míbhuntáistí a bhaineann leis na roghanna sin a leagann amach

source: Generally, the public is asked for submissions on the options proposed
ga: Go ginearálta, iarrtar ar an bpobal tuairimí a chur ar fáil ar na roghanna atá molta

source: After this process is complete, a White Paper is drawn up - this sets out the Government's policy on the issue and what it intends to do
ga: Nuair atá an próiseas sin curtha i gcrích déantar Páipéar Bán a chur le chéile – cuirtear polasaí an Rialtais maidir leis an gceist ar fáil anseo agus an modh oibre atá beartaithe ag an Rialtas

source: The proposals in the White Paper are then implemented
ga: Déantar na moltaí sa Pháipéar Bán a chur i bhfeidhm ansin

source: Sometimes this process occurs but the titles Green and White Papers are not used; they are called discussion documents or something similar
ga: Anois agus arís titeann an próiseas amach mar sin ach ní bhaintear úsáid as na teidil Páipéir Uainí agus Bhána; tugtar cáipéisí le plé nó ainm den chineál sin orthu

source: Sometimes a White Paper is published without a preceding Green Paper
ga: Amanna foilsítear Páipéar Bán gan aon Pháipéar Uaine a bheith foilsithe roimhe

source: Sometimes the process is carried through and then nothing happens after the White Paper is published
ga: Amanna cuirtear an próiseas seo i bhfeidhm agus ní tharlaíonn tada tar éis don Pháipéar Bán a bheith foilsithe

source: Sometimes papers are published which have the same effect as a White Paper but are called strategy documents or similar
ga: Amanna déantar páipéir a fhoilsiú a bhfuil an éifeacht chéanna le Páipéar Bán acu ach tugtar cáipéisí stráitéise nó ainm den chinéal sin orthu

source: The actual public consultation process varies as well
ga: Baintear úsáid as modhanna oibre difriúla freisin anois agus arís le dul i gcomhairle leis an bpobal
